interface UpdateLog {
  date: string;
  content: string;
  comment?: string;
}

export const UPDATE_LOGS: UpdateLog[] = [
  { 
    date: '2026-10-29', 
    content: '新規追加: ツムギ，ラナ，アズサ（レーシング），ヒフミ（レーシング）' 
  },
  { 
    date: '2026-09-27', 
    content: '新規追加: コトネ，ココロ，カスミ（水着），エリナ，アンナ' 
  },
  { 
    date: '2026-08-10', 
    content: '新規追加: サツキ（水着），マコト（水着），チアキ（水着），イブキ（水着），イロハ（水着）' 
  },
  { 
    date: '2026-07-20', 
    content: '不具合について',
    comment: '基幹システム変更により，昨日から通知が送られない不具合が発生していました。現在は以前のシステムに戻すことで対処しています。根本的な解決までは今しばらくお待ちください。' 
  },
  { 
    date: '2026-07-19', 
    content: '贈物追加: キサキ（水着）・シュン（水着）',
    comment: '実装からこちらの追加まで時間が経ってしまい申し訳ありません。管理者が引っ越しのためバタバタしていました。お許しください。' 
  },
  { 
    date: '2026-06-11', 
    content: '贈物追加: ナグサ（水着）',
  },
  { 
    date: '2026-06-10', 
    content: '新規追加: ナグサ（水着）' 
  },
  { 
    date: '2026-06-10', 
    content: '贈物修正: エリカ' 
  },
  { 
    date: '2026-06-07', 
    content: '絆ランク100の未来予想線追加',
    comment: '現在の進捗ペースから絆ランク100に到達する日付を予測して、グラフに破線で描画します。' 
  },
  { 
    date: '2026-06-07', 
    content: '絆ランク記録機能追加',
    comment: '新機能！生徒さんごとに絆上げの記録をつけられるようになりました。日付とランクを入力して登録できます。' 
  },
  { 
    date: '2026-02-08', 
    content: '初回リリース' 
  },
];